## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**❌ &nbsp; Conftest:** `failed` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       RESOURCE                        |
|--------|-------------------------------------------------------|
| add    | `module.ecs.aws_appautoscaling_policy.this[&quot;cpu&quot;]`    |
|        | `module.ecs.aws_appautoscaling_policy.this[&quot;memory&quot;]` |
|        | `module.ecs.aws_appautoscaling_target.this[0]`        |
|        | `module.ecs.aws_ecs_service.this`                     |

| CHANGE |    OUTPUT    |
|--------|--------------|
| add    | `service_id` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_policy.this["cpu"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "cpu"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/blawx-staging-cluster/blawx-staging-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.this["memory"] will be created
  + resource "aws_appautoscaling_policy" "this" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "memory"
      + policy_type        = "TargetTrackingScaling"
      + region             = "ca-central-1"
      + resource_id        = "service/blawx-staging-cluster/blawx-staging-service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 60
          + scale_out_cooldown = 60
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.this[0] will be created
  + resource "aws_appautoscaling_target" "this" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 3
      + min_capacity       = 1
      + region             = "ca-central-1"
      + resource_id        = "service/blawx-staging-cluster/blawx-staging-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags               = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }

      + suspended_state (known after apply)
    }

  # module.ecs.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = "blawx-staging-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "blawx-staging-service"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "SERVICE"
      + region                             = "ca-central-1"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "blawx-staging"
          + "Terraform"  = "true"
        }
      + task_definition                    = "blawx-staging-service:1"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "blawx-container"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:278626299035:targetgroup/blawx-staging-app-tg/c9ae7767df34d77b"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0df4b23e35e4a459c",
            ]
          + subnets          = [
              + "subnet-057e8731d4b371e3c",
              + "subnet-0dd1c3c1dd62ee1d6",
            ]
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_id                = (known after apply)

Warning: Deprecated attribute

  on .terraform/modules/ecs.sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
  85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.ecs.aws_service_discovery_service.this,
  on .terraform/modules/ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
FAIL - plan.json - main - Security group has invalid ports for protocol: ["aws_security_group.ecs_tasks", "aws_security_group.ecs_tasks", "aws_security_group.ecs_tasks"]

20 tests, 19 passed, 0 warnings, 1 failure, 0 exceptions

```

</details>
